<template>
    <div class="about-view">
        <TheLayoutNamedPages title="О проекте">
            <h3>**В качестве тестового задания вам предлагается написать web-приложение на VueJS**</h3>
            <br/>
            <p>_В рамках выполнения тестового задания вам необходимо реализовать ролевую модель доступа к компонентам
                приложения._</p>
            <br/>
            <ul>
                <li>1. Необходимо создать четыре роли – администратор, аналитик, менеджер по продажам, менеджер по закупкам.</li>
                <li>2. Создать три раздела в приложении – администрирование, журнал продаж, журнал покупок.</li>
                <li>3. Ограничить доступ к разделам приложения по роли – администратор – все разделы, аналитик – журнал продаж и
                    журнал закупок, менеджер по продажам - только журнал продаж, менеджер закупкам – только журнал покупок.</li>
                <li>4. В разделе администрирование, необходимо реализовать отображение списка пользователей, списка ролей и
                    назначение роли для пользователя. Для простоты один пользователь одна роль. Должна быть возможность добавить
                    нового пользователя и назначить ему роль из списка.</li>
                <li>5. При входе в приложение под пользователем из списка, отображается доступные разделы, если прав никаких не
                    назначено, то пользователь может войти но ему недоступны никакие разделы.</li>
            </ul>
            <br/>
            <p><code><b>Frontend:</b> VueJS, TypeScript</code></p>
            <p><code><b>Backend:</b> .Net6, C#, ASP.Net</code></p>
            <br/>
            <p>При реализации тестового задания можно:</p>
            <p>- не использовать SQL базу данных (например хранить данные в JSON-файле), использование БД будет считаться
                плюсом</p>
            <p>- использовать другой стек технологий, но тогда предпочтение, при прочих равных, может быть отдано другим
                кандидатам, где реализация тестового задания была с указанным стеком.</p>
            <p>На выполнение тестового задания даётся календарная неделя.</p>
            <p>После выполнения тестового задания, свою реализацию и базу данных необходимо предоставить для проверки в
                любом удобном для вас виде.</p>
            <p>Будут вопросы – пишите.</p>
            <p>Если не успеваете сделать задание до срока не беда, присылайте что есть, будем смотреть ваш подход к решению
                задачи, главное чтобы приложение компилировалось без ошибок.</p>
            <p>Желаю удачи, в выполнении задания.</p>
        </TheLayoutNamedPages>
    </div>
</template>

<script lang="ts" setup>
import TheLayoutNamedPages from "@/components/TheLayoutNamedPages.vue";
</script>

<style scoped lang="scss">
.about-view {
    font-size: 18px;
    font-weight: 400;
    line-height: 20px;
}
</style>
